import org.jivesoftware.smack.ConnectionConfiguration;
import org.jivesoftware.smack.SmackException;
import org.jivesoftware.smack.XMPPException;
import org.jivesoftware.smack.chat.Chat;
import org.jivesoftware.smack.chat.ChatManager;
import org.jivesoftware.smack.packet.Message;
import org.jivesoftware.smack.tcp.XMPPTCPConnection;
import org.jivesoftware.smack.tcp.XMPPTCPConnectionConfiguration;

import java.io.IOException;

/**
 * 上海拙心网络科技有限公司出品
 * Author: 赵朋扬
 * Date: 2016/3/2.
 */
public class Main {

    public static void main(String[] args) throws IOException, XMPPException, SmackException {
        XMPPTCPConnectionConfiguration.Builder config = XMPPTCPConnectionConfiguration.builder();
        config.setSecurityMode(ConnectionConfiguration.SecurityMode.disabled);
        config.setUsernameAndPassword("abc1", "abc111111");
        config.setServiceName("iz23a2nwds6z");
        config.setHost("121.40.225.216");
        config.setPort(5222);
        config.setDebuggerEnabled(true);
        XMPPTCPConnection conn = new XMPPTCPConnection(config.build());
        conn.connect().login();
        Chat chat = ChatManager.getInstanceFor(conn).createChat("abc0@iz23a2nwds6z");
        // chat.sendMessage("Hello");
        Message message = new Message();
        message.setSubject("tips");
        message.setFrom("abc1000");
        message.setBody("\n" +
                "笑话集LOGO\n" +
                "发表笑话,赚取奖金 | 登录 | 注册\n" +
                "QQ鐧诲綍 发表笑话\n" +
                "首 页最新笑话笑话分类笑话排行笑话风云榜笑话大赛搞笑图片QQ图片大全名人名言QQ个性签名\n" +
                "搜索： \n" +
                "点击搜索笑话\n" +
                "\n" +
                "\n" +
                "首页 -> 爆笑男女 -> 玩笑男女的小幽默浏览量: 1784 次\n" +
                "\n" +
                "字体：[大]　[中]　[小]　[打印]\n" +
                "\n" +
                " 阅读技巧：键盘 ←左 右→ 翻页，Ctrl+D 收藏本篇笑话\n" +
                "1、面对着女友审视的目光，我解释说：“那天她手机没电了，让我给她拍一张。”\n" +
                "女友仔细打量着这张照片，不无讽刺地说：“哟，看来你给她拍得很用心哪，拍得这么好看！”\n" +
                "我忙解释：“就随便拍的。”\n" +
                "女友说：“那你的意思是说她随便一拍都很好看？”\n" +
                "\n" +
                "2、前女友给我来信息：你现在好吗？\n" +
                "我：谢谢！还活着！\n" +
                "她：不光要活着，还要活好！\n" +
                "我：我活好你就不会离开我了！\n" +
                "\n" +
                "3、“哎！你知道吗？我发现我有超能力！”\n" +
                "“有什么超能力？”\n" +
                "“我发现每次我对女的表白后，他们都有男朋友了”\n" +
                "\n" +
                "4、一女把出生不久的孩子的照片传到网上。\n" +
                "今天去看时看到一条神级回复：看到这孩子一点也不像我，我就放心了。\n" +
                "\n" +
                "5、有个妹子去菜市场买菜。\n" +
                "问小贩：黄瓜怎么卖？\n" +
                "小贩：现在都用玉米，谁还用黄瓜。\n" +
                "妹子：我买黄瓜是敷脸的。\n" +
                "买了黄瓜，小贩：还要点什么吗？\n" +
                "妹子：玉米怎么卖。。。\n" +
                "\n" +
                "看笑话就上：笑话集 www.jokeji.cn\n" +
                "发表评论票数:3发布时间：2016/3/1 23:11:24\n" +
                "\n" +
                "下一篇：笑话集原创笑话精品展第102期 上一篇：乐爆,最不缺笑的是逗B\n" +
                "\n" +
                "相关笑话\n" +
                "这些玩笑开的太好笑了！要命！女朋友的口头禅让我头疼不已爆笑女子,也是没谁了逗B出没,爱笑往里戳猛人出没，小心雷倒恋人和夫妻之间的幽默笑爆,走在逗B的路上单身狗哥们儿之间乐逍遥成为屌丝是有原因的搞笑个性签名一句话。男女撒谎出现比例最高的十大谎言叫众骚年不淡定的爆笑妹子爆囧, 这是要翻脸的节奏风趣段子里的雷人爆笑事儿。囧到翻滚,尴尬时分笑点多俏皮一句话短信息雷人男女很冷很受伤幽默笑人的风趣男女\n" +
                "\n" +
                "评论内容\n" +
                "这儿有个沙发还暂时没人座！\n" +
                "发表评论\n" +
                "\n" +
                "评论内容：\n" +
                "验证码：\n" +
                "点击获取验证码   提 交 \n" +
                "热门笑话排行\n" +
                "老妈啊,你们可真逗！公交车上的笑话情人节搞怪动物短信，逗情人开心的必备短信婚后的小两口最是没节操男女爆笑之没羞没臊,没脸没皮比较有道理的俏皮语录讽刺类的冷笑话几则一波高冷的经典冷段儿\n" +
                "精彩笑话推荐\n" +
                "屌丝做梦也是屌丝中秋节幽默搞笑短信笑话饱含笑意,精彩爆冷小句段郭德纲语录集锦谁是孩子的父亲爆笑的熊宝宝和萌宝宝动物有钱后的雷人想法。笑呆你的校园二货“才”华出众,会是啥才呢?你懂的\n" +
                "推荐资讯信息\n" +
                "\n" +
                "\n" +
                "\n" +
                "笑话集 www.Jokeji.cn 永久域名 Copyright © All Rights Reserved 沪ICP备09013142号 \n" +
                "如果你喜欢本站,请把本站告诉给你QQ上的朋友哦! 如果网站内容侵犯到您的权益,请联系我们,我们会在24小时内删除.\n" +
                "温馨提示：Ctrl+D 会有惊喜哦，你试试看！     \n" +
                "Close\n" +
                "\n" +
                "\n" +
                "\n" +
                "笑话集LOGO\n" +
                "发表笑话,赚取奖金 | 登录 | 注册\n" +
                "QQ鐧诲綍 发表笑话\n" +
                "首 页最新笑话笑话分类笑话排行笑话风云榜笑话大赛搞笑图片QQ图片大全名人名言QQ个性签名\n" +
                "搜索： \n" +
                "点击搜索笑话\n" +
                "\n" +
                "\n" +
                "首页 -> 爆笑男女 -> 玩笑男女的小幽默浏览量: 1784 次\n" +
                "\n" +
                "字体：[大]　[中]　[小]　[打印]\n" +
                "\n" +
                " 阅读技巧：键盘 ←左 右→ 翻页，Ctrl+D 收藏本篇笑话\n" +
                "1、面对着女友审视的目光，我解释说：“那天她手机没电了，让我给她拍一张。”\n" +
                "女友仔细打量着这张照片，不无讽刺地说：“哟，看来你给她拍得很用心哪，拍得这么好看！”\n" +
                "我忙解释：“就随便拍的。”\n" +
                "女友说：“那你的意思是说她随便一拍都很好看？”\n" +
                "\n" +
                "2、前女友给我来信息：你现在好吗？\n" +
                "我：谢谢！还活着！\n" +
                "她：不光要活着，还要活好！\n" +
                "我：我活好你就不会离开我了！\n" +
                "\n" +
                "3、“哎！你知道吗？我发现我有超能力！”\n" +
                "“有什么超能力？”\n" +
                "“我发现每次我对女的表白后，他们都有男朋友了”\n" +
                "\n" +
                "4、一女把出生不久的孩子的照片传到网上。\n" +
                "今天去看时看到一条神级回复：看到这孩子一点也不像我，我就放心了。\n" +
                "\n" +
                "5、有个妹子去菜市场买菜。\n" +
                "问小贩：黄瓜怎么卖？\n" +
                "小贩：现在都用玉米，谁还用黄瓜。\n" +
                "妹子：我买黄瓜是敷脸的。\n" +
                "买了黄瓜，小贩：还要点什么吗？\n" +
                "妹子：玉米怎么卖。。。\n" +
                "\n" +
                "看笑话就上：笑话集 www.jokeji.cn\n" +
                "发表评论票数:3发布时间：2016/3/1 23:11:24\n" +
                "\n" +
                "下一篇：笑话集原创笑话精品展第102期 上一篇：乐爆,最不缺笑的是逗B\n" +
                "\n" +
                "相关笑话\n" +
                "这些玩笑开的太好笑了！要命！女朋友的口头禅让我头疼不已爆笑女子,也是没谁了逗B出没,爱笑往里戳猛人出没，小心雷倒恋人和夫妻之间的幽默笑爆,走在逗B的路上单身狗哥们儿之间乐逍遥成为屌丝是有原因的搞笑个性签名一句话。男女撒谎出现比例最高的十大谎言叫众骚年不淡定的爆笑妹子爆囧, 这是要翻脸的节奏风趣段子里的雷人爆笑事儿。囧到翻滚,尴尬时分笑点多俏皮一句话短信息雷人男女很冷很受伤幽默笑人的风趣男女\n" +
                "\n" +
                "评论内容\n" +
                "这儿有个沙发还暂时没人座！\n" +
                "发表评论\n" +
                "\n" +
                "评论内容：\n" +
                "验证码：\n" +
                "点击获取验证码   提 交 \n" +
                "热门笑话排行\n" +
                "老妈啊,你们可真逗！公交车上的笑话情人节搞怪动物短信，逗情人开心的必备短信婚后的小两口最是没节操男女爆笑之没羞没臊,没脸没皮比较有道理的俏皮语录讽刺类的冷笑话几则一波高冷的经典冷段儿\n" +
                "精彩笑话推荐\n" +
                "屌丝做梦也是屌丝中秋节幽默搞笑短信笑话饱含笑意,精彩爆冷小句段郭德纲语录集锦谁是孩子的父亲爆笑的熊宝宝和萌宝宝动物有钱后的雷人想法。笑呆你的校园二货“才”华出众,会是啥才呢?你懂的\n" +
                "推荐资讯信息\n" +
                "\n" +
                "\n" +
                "\n" +
                "笑话集 www.Jokeji.cn 永久域名 Copyright © All Rights Reserved 沪ICP备09013142号 \n" +
                "如果你喜欢本站,请把本站告诉给你QQ上的朋友哦! 如果网站内容侵犯到您的权益,请联系我们,我们会在24小时内删除.\n" +
                "温馨提示：Ctrl+D 会有惊喜哦，你试试看！     \n" +
                "Close\n" +
                "\n" +
                "\n" +
                "\n" +
                "笑话集LOGO\n" +
                "发表笑话,赚取奖金 | 登录 | 注册\n" +
                "QQ鐧诲綍 发表笑话\n" +
                "首 页最新笑话笑话分类笑话排行笑话风云榜笑话大赛搞笑图片QQ图片大全名人名言QQ个性签名\n" +
                "搜索： \n" +
                "点击搜索笑话\n" +
                "\n" +
                "\n" +
                "首页 -> 爆笑男女 -> 玩笑男女的小幽默浏览量: 1784 次\n" +
                "\n" +
                "字体：[大]　[中]　[小]　[打印]\n" +
                "\n" +
                " 阅读技巧：键盘 ←左 右→ 翻页，Ctrl+D 收藏本篇笑话\n" +
                "1、面对着女友审视的目光，我解释说：“那天她手机没电了，让我给她拍一张。”\n" +
                "女友仔细打量着这张照片，不无讽刺地说：“哟，看来你给她拍得很用心哪，拍得这么好看！”\n" +
                "我忙解释：“就随便拍的。”\n" +
                "女友说：“那你的意思是说她随便一拍都很好看？”\n" +
                "\n" +
                "2、前女友给我来信息：你现在好吗？\n" +
                "我：谢谢！还活着！\n" +
                "她：不光要活着，还要活好！\n" +
                "我：我活好你就不会离开我了！\n" +
                "\n" +
                "3、“哎！你知道吗？我发现我有超能力！”\n" +
                "“有什么超能力？”\n" +
                "“我发现每次我对女的表白后，他们都有男朋友了”\n" +
                "\n" +
                "4、一女把出生不久的孩子的照片传到网上。\n" +
                "今天去看时看到一条神级回复：看到这孩子一点也不像我，我就放心了。\n" +
                "\n" +
                "5、有个妹子去菜市场买菜。\n" +
                "问小贩：黄瓜怎么卖？\n" +
                "小贩：现在都用玉米，谁还用黄瓜。\n" +
                "妹子：我买黄瓜是敷脸的。\n" +
                "买了黄瓜，小贩：还要点什么吗？\n" +
                "妹子：玉米怎么卖。。。\n" +
                "\n" +
                "看笑话就上：笑话集 www.jokeji.cn\n" +
                "发表评论票数:3发布时间：2016/3/1 23:11:24\n" +
                "\n" +
                "下一篇：笑话集原创笑话精品展第102期 上一篇：乐爆,最不缺笑的是逗B\n" +
                "\n" +
                "相关笑话\n" +
                "这些玩笑开的太好笑了！要命！女朋友的口头禅让我头疼不已爆笑女子,也是没谁了逗B出没,爱笑往里戳猛人出没，小心雷倒恋人和夫妻之间的幽默笑爆,走在逗B的路上单身狗哥们儿之间乐逍遥成为屌丝是有原因的搞笑个性签名一句话。男女撒谎出现比例最高的十大谎言叫众骚年不淡定的爆笑妹子爆囧, 这是要翻脸的节奏风趣段子里的雷人爆笑事儿。囧到翻滚,尴尬时分笑点多俏皮一句话短信息雷人男女很冷很受伤幽默笑人的风趣男女\n" +
                "\n" +
                "评论内容\n" +
                "这儿有个沙发还暂时没人座！\n" +
                "发表评论\n" +
                "\n" +
                "评论内容：\n" +
                "验证码：\n" +
                "点击获取验证码   提 交 \n" +
                "热门笑话排行\n" +
                "老妈啊,你们可真逗！公交车上的笑话情人节搞怪动物短信，逗情人开心的必备短信婚后的小两口最是没节操男女爆笑之没羞没臊,没脸没皮比较有道理的俏皮语录讽刺类的冷笑话几则一波高冷的经典冷段儿\n" +
                "精彩笑话推荐\n" +
                "屌丝做梦也是屌丝中秋节幽默搞笑短信笑话饱含笑意,精彩爆冷小句段郭德纲语录集锦谁是孩子的父亲爆笑的熊宝宝和萌宝宝动物有钱后的雷人想法。笑呆你的校园二货“才”华出众,会是啥才呢?你懂的\n" +
                "推荐资讯信息\n" +
                "\n" +
                "\n" +
                "\n" +
                "笑话集 www.Jokeji.cn 永久域名 Copyright © All Rights Reserved 沪ICP备09013142号 \n" +
                "如果你喜欢本站,请把本站告诉给你QQ上的朋友哦! 如果网站内容侵犯到您的权益,请联系我们,我们会在24小时内删除.\n" +
                "温馨提示：Ctrl+D 会有惊喜哦，你试试看！     \n" +
                "Close\n" +
                "\n" +
                "\n" +
                "\n" +
                "笑话集LOGO\n" +
                "发表笑话,赚取奖金 | 登录 | 注册\n" +
                "QQ鐧诲綍 发表笑话\n" +
                "首 页最新笑话笑话分类笑话排行笑话风云榜笑话大赛搞笑图片QQ图片大全名人名言QQ个性签名\n" +
                "搜索： \n" +
                "点击搜索笑话\n" +
                "\n" +
                "\n" +
                "首页 -> 爆笑男女 -> 玩笑男女的小幽默浏览量: 1784 次\n" +
                "\n" +
                "字体：[大]　[中]　[小]　[打印]\n" +
                "\n" +
                " 阅读技巧：键盘 ←左 右→ 翻页，Ctrl+D 收藏本篇笑话\n" +
                "1、面对着女友审视的目光，我解释说：“那天她手机没电了，让我给她拍一张。”\n" +
                "女友仔细打量着这张照片，不无讽刺地说：“哟，看来你给她拍得很用心哪，拍得这么好看！”\n" +
                "我忙解释：“就随便拍的。”\n" +
                "女友说：“那你的意思是说她随便一拍都很好看？”\n" +
                "\n" +
                "2、前女友给我来信息：你现在好吗？\n" +
                "我：谢谢！还活着！\n" +
                "她：不光要活着，还要活好！\n" +
                "我：我活好你就不会离开我了！\n" +
                "\n" +
                "3、“哎！你知道吗？我发现我有超能力！”\n" +
                "“有什么超能力？”\n" +
                "“我发现每次我对女的表白后，他们都有男朋友了”\n" +
                "\n" +
                "4、一女把出生不久的孩子的照片传到网上。\n" +
                "今天去看时看到一条神级回复：看到这孩子一点也不像我，我就放心了。\n" +
                "\n" +
                "5、有个妹子去菜市场买菜。\n" +
                "问小贩：黄瓜怎么卖？\n" +
                "小贩：现在都用玉米，谁还用黄瓜。\n" +
                "妹子：我买黄瓜是敷脸的。\n" +
                "买了黄瓜，小贩：还要点什么吗？\n" +
                "妹子：玉米怎么卖。。。\n" +
                "\n" +
                "看笑话就上：笑话集 www.jokeji.cn\n" +
                "发表评论票数:3发布时间：2016/3/1 23:11:24\n" +
                "\n" +
                "下一篇：笑话集原创笑话精品展第102期 上一篇：乐爆,最不缺笑的是逗B\n" +
                "\n" +
                "相关笑话\n" +
                "这些玩笑开的太好笑了！要命！女朋友的口头禅让我头疼不已爆笑女子,也是没谁了逗B出没,爱笑往里戳猛人出没，小心雷倒恋人和夫妻之间的幽默笑爆,走在逗B的路上单身狗哥们儿之间乐逍遥成为屌丝是有原因的搞笑个性签名一句话。男女撒谎出现比例最高的十大谎言叫众骚年不淡定的爆笑妹子爆囧, 这是要翻脸的节奏风趣段子里的雷人爆笑事儿。囧到翻滚,尴尬时分笑点多俏皮一句话短信息雷人男女很冷很受伤幽默笑人的风趣男女\n" +
                "\n" +
                "评论内容\n" +
                "这儿有个沙发还暂时没人座！\n" +
                "发表评论\n" +
                "\n" +
                "评论内容：\n" +
                "验证码：\n" +
                "点击获取验证码   提 交 \n" +
                "热门笑话排行\n" +
                "老妈啊,你们可真逗！公交车上的笑话情人节搞怪动物短信，逗情人开心的必备短信婚后的小两口最是没节操男女爆笑之没羞没臊,没脸没皮比较有道理的俏皮语录讽刺类的冷笑话几则一波高冷的经典冷段儿\n" +
                "精彩笑话推荐\n" +
                "屌丝做梦也是屌丝中秋节幽默搞笑短信笑话饱含笑意,精彩爆冷小句段郭德纲语录集锦谁是孩子的父亲爆笑的熊宝宝和萌宝宝动物有钱后的雷人想法。笑呆你的校园二货“才”华出众,会是啥才呢?你懂的\n" +
                "推荐资讯信息\n" +
                "\n" +
                "\n" +
                "\n" +
                "笑话集 www.Jokeji.cn 永久域名 Copyright © All Rights Reserved 沪ICP备09013142号 \n" +
                "如果你喜欢本站,请把本站告诉给你QQ上的朋友哦! 如果网站内容侵犯到您的权益,请联系我们,我们会在24小时内删除.\n" +
                "温馨提示：Ctrl+D 会有惊喜哦，你试试看！     \n" +
                "Close\n" +
                "\n" +
                "\n");
        message.setType(Message.Type.chat);
        chat.sendMessage(message);

    }
}
